#include <stdio.h>//підключаня необхідних для роботи бібліотек

#define MAX_SIZE 100
//Функція для знаходження максимального значення між двома елементами матриці
int findMax(int matrix[MAX_SIZE][MAX_SIZE], int n, int m, int i1, int j1, int i2, int j2) {
    // Знаходимо значення двох вказаних елементів
    int num1 = matrix[i1][j1];
    int num2 = matrix[i2][j2];

    // Знаходимо максимальне значення
    int max = (num1 > num2) ? num1 : num2;

    return max;
}

int main() {
    int n, m;  //Розміри матриці
    int i1, j1, i2, j2;  //Координати двох елементів
    int matrix[MAX_SIZE][MAX_SIZE];

    printf("Введіть розміри матриці (n та m): ");//Введеня необхідної для обчислення інформації з клавіатури
    scanf_s("%d %d", &n, &m);

    printf("Введіть елементи матриці:\n");
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            printf("Елемент [%d][%d]: ", i, j);
            scanf_s("%d", &matrix[i][j]);
        }
    }

    printf("Введіть координати першого елемента (i1 та j1): ");
    scanf_s("%d %d", &i1, &j1);

    printf("Введіть координати другого елемента (i2 та j2): ");
    scanf_s("%d %d", &i2, &j2);
    //Викликаємо функцію findMax для знаходження максимального значення між двома елементами матриці
    int max = findMax(matrix, n, m, i1, j1, i2, j2);

    printf("Максимальне значення з вказаних чисел: %d\n", max);//Виведеня результатів на екран юзера

    return 0;//кінець програми
}

